snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/ЗаданиеНаАгрегацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаАгрегацию</name>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистыСозданы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацииЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНоменклатурыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяКоробка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЛистСборкиКомплектовЧЗ/ЛистСборкиКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистСборкиКомплектовЧЗ</name>
  <comment>Лист сборки комплектов маркированого товара </comment>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фРежим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СборщикКомплектаТСД</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>КодКомплектаПодтвержденСканированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКомплекта</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияКомплекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/ЗаданиеНаСборкуКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаСборкуКомплектовЧЗ</name>
  <comment>Задание на сборку комплектов ЗЧ</comment>
  <basedOn>Document.ЗаданиеНабора</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНабора</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработкиЧЗ</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаркированыеКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистСборки</name>
      <type>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированПодСборку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокЛистовПереукладки, 		"Ссылка", Объект.Ссылка);
 	МаркировкаКС.УстановитьПараметрДинамическогоСписка(ПланФакт, 		"Ссылка", Объект.Ссылка);

	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЛистыПереукладкиНаСервере()  
	если не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность тогда
		Записать();
	КонецЕсли;                 
	
	возврат документы.ЗаданиеНаАгрегацию.ЗаполнитьЛистыПереукладкиПоЗНА(объект.Ссылка)
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЛистыПереукладки(Команда)
	Результат = ЗаполнитьЛистыПереукладкиНаСервере();
	если не Результат.Успех тогда
		Сообщить(СтрСоединить(Результат.Ошибки,символы.ПС));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЛистовПереукладкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
ТекущаяСтрока = Элементы.СписокЛистовПереукладки.ТекущиеДанные;   
ОткрытьЗначение(ТекущаяСтрока.ссылка);

КонецПроцедуры

&НаСервере
Функция СформироватьQRНаСервере()
	Строка= ЗначениеВСтрокуВнутр(Объект.Ссылка);     
	Строка = стрзаменить(Строка,"¶","");
	Строка = стрзаменить(Строка,символы.ПС,"");
	ОбработкаФормированияКартинки = Обработки.СформироватьКартинкуКодаШКQR.Создать();
		Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
		ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
	//СтруктураДанных = новый Структура("Document,BoxCount,TSD,User",Строка,2,"S001",Справочники.ФизическиеЛица.НайтиПоКоду("SNL-01034"));
	//Сообщить(Строка);       
	//СтрокаСериализованная = ПолучитьДвоичныеДанныеИзСтроки(ОбменДаннымиЧЗ.СериализоватьВJSON(СтруктураДанных));    
	//СтрокаСериализованная = ОбменДаннымиЧЗ.СериализоватьВJSON(СтруктураДанных);
	//Сообщить(СтрокаСериализованная);         
	//ЗаписатьВЛог("Отладка",СтрокаСериализованная,"Система");
	
	//Данные = ОбменДаннымиЧЗ.ПрочитатьИзJSON(СтрокаСериализованная);  
	ТД=новый ТабличныйДокумент;
	тд.ИмяПараметровПечати = "ПечатьЗНА";
	СтруктураДанныхКомпонентыПечати=ОбработкаФормированияКартинки.ПолучитьКомпонентуФормированияDataMatrixКода();	
	//СформироватьQRНаСервере(); 
	Макет = Документы.ЗаданиеНаАгрегацию.ПолучитьМакет("Макет");
	ОблЭтикетка=Макет.ПолучитьОбласть("Строка");
	Рисунок=ОблЭтикетка.Рисунки.QRКод; 		
	ДопПараметры = новый Структура;	
	КартинкаКода=ОбработкаФормированияКартинки.СформироватьКартинкуШК_DataMatrix(СтруктураДанныхКомпонентыПечати,Строка,ДопПараметры);  
	Рисунок.Картинка=КартинкаКода;        
	тд.Вывести(ОблЭтикетка);
	возврат ТД;
		
КонецФункции

&НаКлиенте
Процедура СформироватьQR(Команда) 
 ТД = СформироватьQRНаСервере();	  
 ТД.показать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВернутьЛистВРаботуНаСервере(Лист)
	Документы.ЛистПереукладки.ВернутьЛистОтЗНАВРаботу(Лист);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьЛистВРаботу(Команда) 
	ТекущаяСтрока = Элементы.СписокЛистовПереукладки.ТекущиеДанные;    
	если ТекущаяСтрока<>Неопределено тогда
		ВернутьЛистВРаботуНаСервере(ТекущаяСтрока.Ссылка);
		элементы.СписокЛистовПереукладки.Обновить();         
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьНумерациюКоробов(Команда)
	ПерезаполнитьНумерациюКоробовНаСервере(Объект.ДокОснование);
	элементы.СписокЛистовПереукладки.Обновить();
	Сообщить("Готово");
КонецПроцедуры       

&НаСервереБезКонтекста
Процедура ПерезаполнитьНумерациюКоробовНаСервере(Накладная)
	Документы.ЛистПереукладки.ПереномероватьВсеКоробкиНакладной(Накладная);	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаСервере()           
	
 ДокОбъект = РеквизитФормыВЗначение("Объект");   
 ДокОбъект.ОбработкаЗаполнения(объект.ДокОснование,"",Истина);
 ДокОбъект.записать();
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)
	ПерезаполнитьНаСервере();
	Закрыть();
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000063 - 2026.06.22
&НаКлиенте
Процедура ВернутьКодыЧЗВРезерв(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ДокОснование) Тогда
		
		Сообщить("Не указан док.основание!");
		
		Возврат;
		
	КонецЕсли;
	
	ДопПараметрыНакладной = ОбщегоНазначения_ПИ.ПолучитьДопПараметрыНакладной(Объект.ДокОснование);
	
	Если Не ДопПараметрыНакладной.ОтгрузкаFBS Тогда
		
		Сообщить("Очистка разрешена только для FBS!");
		
		Возврат;
		
	КонецЕсли;
		
	ТекстОповещения = ВернутьКодыЧЗВРезервНаСервере();
	
	Если ЗначениеЗаполнено(ТекстОповещения) Тогда
		
		Сообщить(ТекстОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

// Кельманов А.В. - ИЗМ-0000000063 - 2026.06.22
&НаСервере
Функция ВернутьКодыЧЗВРезервНаСервере()
	
	ТекстОповещения = "";
	МассивТекстов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Лист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистПереукладки КАК Лист
	|ГДЕ
	|	Лист.ДокОснование = &Накладная
	|	И Лист.Проведен";
	
	Запрос.УстановитьПараметр("Накладная", Объект.ДокОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЛистОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ЛистОбъект.ШтрихкодыУпаковок.Очистить();
		ЛистОбъект.Товары.Очистить();
		
		ЛистОбъект.ЛСК = ПредопределенноеЗначение("Документ.ЛистСборкиКомплектовЧЗ.ПустаяСсылка");
		ЛистОбъект.Завершен = Ложь;
		ЛистОбъект.Проведен = Ложь;
		ЛистОбъект.ПометкаУдаления = Истина;
		
		ЛистОбъект.Записать();
		
		МассивТекстов.Добавить("Очищен "+ЛистОбъект);
		
	КонецЦикла;
	
	Если ПолучитьРеквизитШапки(Объект.ДокОснование, "ОтгрузкаКомплектов", "Документ") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Лист.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистСборкиКомплектовЧЗ КАК Лист
		|ГДЕ
		|	Лист.ДокОснование.ДокОснование = &Накладная
		|	И Лист.Проведен";
		
		Запрос.УстановитьПараметр("Накладная", Объект.ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЛистОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЛистОбъект.ШтрихкодыУпаковок.Очистить();
			ЛистОбъект.Товары.Очистить();
			
			ЛистОбъект.ЛистНабора = Неопределено; // Кельманов А.В. - Оптимизация работы - 2026.07.08
			
			ЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			МассивТекстов.Добавить("Очищен " + ЛистОбъект);
			
		КонецЦикла;

		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗСБ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗСБ
		|ГДЕ
		|	ЗСБ.ДокОснование = &Накладная
		|	И ЗСБ.Проведен";
		
		Запрос.УстановитьПараметр("Накладная", Объект.ДокОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ДокОбъект.ШтрихкодыУпаковок.Очистить();
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			МассивТекстов.Добавить("Очищен " + ДокОбъект);
			
		КонецЦикла;

		Документы.ЗаданиеНаСборкуКомплектовЧЗ.НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(Объект.ДокОснование);
		
	КонецЕсли;
	
	Если МассивТекстов.Количество() > 0 Тогда                 
		
		ТекстОповещения = СтрСоединить(МассивТекстов, Символы.ПС);
		
	КонецЕсли;
	
	Возврат ТекстОповещения;
	
КонецФункции
